[
    {
        "title":"C-sharp-patterns",
        "description":"В этом проекте я учился работать с ООП, а также применять шаблоны проектирования.",
        "refs":[{"site":"github.com/c# OOP","ref":"https://github.com/Lokinsky/C_sharp_patterns"}]
    },
    {
        "title":"Mine-Plugin-Craft",
        "description":"Ну из названия можно понять, что это разрабатывалось исключительно для игры, а если конкретнее – Minecraft. В нем я хотел собрать: авторизацию, привилегии, глобальные правила по доступу к игровому миру, а пока там есть только авторизация.",
        "refs":[{"site":"github.com/minecraft plugin","ref":"https://github.com/Lokinsky/mine_plugin_craft"}]},
    {
        "title":"Tcp-Udp-Server",
        "description":"TCP-сервер и UDP-сервер, которые предназначались для создания voice-chat приложения.Особенности TCP-сервера: авторизации через веб-токен (JWT), управление привилегиями, защищенный обмен даннымиВнутри данного проекта присутствует клиент, написанный также на языке C#.Проект заморожен.",  
        "refs":[{"site":"github.com/tcp server","ref":"https://github.com/Lokinsky/Tcp-Udp-Server"}]},
    {
        "title":"Веб-клиент",
        "description":"Проект ореинтирован на веб-технологии. Стек: Javascript, CSS, jQuery, vue.js. В этом проекте реализован standalone-core, который был написан мной.Это ядро включает в себя: управление плагинами, а также подключение любых других, которые можно написать самому. Для данного ядра был разработан адаптер для vue.js – Vue_adapter_core.js.Также в него входит и шина данных – bus.js, с помощью которой можно обмениваться данными между плагинами, а также производить запрос к плагину из приложения.autolayout_core.js – плагин, который позволяет упростить верстку за счет описанных функций группировок.animation_core.js – плагин, инкапуслирующий в себя все функции, которые работают с любой анимацией – в данный момент находится в разработке.",
        "refs":[
                {"site":"github.com/web client","ref":"https://github.com/Lokinsky/web-client"},
                {"site":"Lokinsky.github.io","ref":"/#/summary"},
                {"site":"github/summary","ref":"https://github.com/Lokinsky/Summary.git"}
                ] 

    }
]